{
	"version": "https://jsonfeed.org/version/1",
	"title": "Getting Grey",
	"icon": "https://micro.blog/gettinggrey/avatar.jpg",
	"home_page_url": "https://www.gettinggrey.com/",
	"feed_url": "https://www.gettinggrey.com/feed.json",
	"items": [
		
			{
				"id": "http://gettinggrey.micro.blog/2025/04/10/heathrows-outage-coverage-missing-context.html",
				"title": "Heathrow’s Outage Coverage: Missing Context",
				"content_html": "<p><a href=\"https://www.nytimes.com/by/stephen-castle\">Stephen Castle</a><a href=\"https://www.nytimes.com/by/michael-d-shear\">Michael D. Shear</a> and <a href=\"https://www.nytimes.com/by/peter-eavis\">Peter Eavis</a> writing for the New York Times:</p>\n<blockquote>\n<p>“Unfortunately, there is no resilience built into the National Grid,” Mr. Kuball, a Royal Academy of Engineering chair in emerging technologies, wrote at the Science Media Center. “In part, this is because we still rely on old technology in substations that use copper windings to distribute power rather than new technology, so-called solid state transformers.”</p>\n</blockquote>\n<p>There is no context provided for this quote in the <a href=\"https://www.nytimes.com/2025/03/23/world/europe/heathrow-airport-fire-infrastructure.html?smid=nytcore-ios-share&amp;referringSource=articleShare\" title=\"How Did a Fire Leave Heathrow Airport in Darkness, With Insufficient Backup?\">original article</a>, so I will provide some here.</p>\n<p>Resilience is an interesting word for Mr. Kuball to choose. The UK’s National Grid is widely considered to be one of the more resilient electrical systems in the world. It has redundancies, protections, and a generally high level of reliability. I will give Mr. Kuball the benefit of the doubt and assume he did not mean to say that the National Grid has no resilience as surely that would effectively mean the grid is non-functional. Grids are constantly adapting and functioning despite operational errors, equipment failures, and natural disasters. What <em>doesn’t</em> have built-in resilience, apparently, is Heathrow’s internal power architecture. Blaming the entire national grid for what appears to be a single point of failure at one site is a misdirection. The article repeats this quote without question, which misses the more interesting and relevant problem: Heathrow couldn’t rapidly switch over to its other power sources. There is not a law of physics which requires hour long outages to switch over power sources. The hours long outage at Heathrow is likely a result of cost and design tradeoffs which, in hindsight, may have been made differently. In this context, resilient doesn’t mean outages never happen — it means systems are designed to limit the impact and recover quickly when they do.</p>\n<p>It is also weird to drop in a reference to copper winding as old technology. While copper winding transformers were invented nearly 200 years ago they are still by far the most commonly put into service in most applications today. Solid-state transformers are an emerging technology. They’re promising, yes, but not a drop-in replacement for traditional grid equipment — not yet, and certainly not at the scale of a major airport. Suggesting that their absence is the root cause of the Heathrow failure is a distraction. Infrastructure resilience has more to do with <strong>system design, failover logic, and coordination</strong> than simply deploying the newest tech. Infrastructure as critical as Heathrow should be designed with redundancy in mind, such that it could withstand the failure of any single transformer.</p>\n<p>If you are aware of any utilities using Solid-state transformers as direct replacement for oil-filled traditional transformers please let me know.</p>\n",
				"content_text": "[Stephen Castle](https://www.nytimes.com/by/stephen-castle)[Michael D. Shear](https://www.nytimes.com/by/michael-d-shear) and [Peter Eavis](https://www.nytimes.com/by/peter-eavis) writing for the New York Times:\n\n> “Unfortunately, there is no resilience built into the National Grid,” Mr. Kuball, a Royal Academy of Engineering chair in emerging technologies, wrote at the Science Media Center. “In part, this is because we still rely on old technology in substations that use copper windings to distribute power rather than new technology, so-called solid state transformers.”\n\nThere is no context provided for this quote in the [original article](https://www.nytimes.com/2025/03/23/world/europe/heathrow-airport-fire-infrastructure.html?smid=nytcore-ios-share&referringSource=articleShare \"How Did a Fire Leave Heathrow Airport in Darkness, With Insufficient Backup?\"), so I will provide some here.\n\nResilience is an interesting word for Mr. Kuball to choose. The UK’s National Grid is widely considered to be one of the more resilient electrical systems in the world. It has redundancies, protections, and a generally high level of reliability. I will give Mr. Kuball the benefit of the doubt and assume he did not mean to say that the National Grid has no resilience as surely that would effectively mean the grid is non-functional. Grids are constantly adapting and functioning despite operational errors, equipment failures, and natural disasters. What *doesn’t* have built-in resilience, apparently, is Heathrow’s internal power architecture. Blaming the entire national grid for what appears to be a single point of failure at one site is a misdirection. The article repeats this quote without question, which misses the more interesting and relevant problem: Heathrow couldn’t rapidly switch over to its other power sources. There is not a law of physics which requires hour long outages to switch over power sources. The hours long outage at Heathrow is likely a result of cost and design tradeoffs which, in hindsight, may have been made differently. In this context, resilient doesn’t mean outages never happen — it means systems are designed to limit the impact and recover quickly when they do.\n\nIt is also weird to drop in a reference to copper winding as old technology. While copper winding transformers were invented nearly 200 years ago they are still by far the most commonly put into service in most applications today. Solid-state transformers are an emerging technology. They’re promising, yes, but not a drop-in replacement for traditional grid equipment — not yet, and certainly not at the scale of a major airport. Suggesting that their absence is the root cause of the Heathrow failure is a distraction. Infrastructure resilience has more to do with **system design, failover logic, and coordination** than simply deploying the newest tech. Infrastructure as critical as Heathrow should be designed with redundancy in mind, such that it could withstand the failure of any single transformer. \n\nIf you are aware of any utilities using Solid-state transformers as direct replacement for oil-filled traditional transformers please let me know.\n\n\n",
				"date_published": "2025-04-10T22:30:52-06:00",
				"url": "https://www.gettinggrey.com/2025/04/10/heathrows-outage-coverage-missing-context.html",
				"tags": ["energy"]
			},
			{
				"id": "http://gettinggrey.micro.blog/2025/01/18/hello-world.html",
				"title": "Hello, World!",
				"content_html": "<p>My intention is that when I write, I will write about something that I find useful or interesting.</p>\n",
				"content_text": "My intention is that when I write, I will write about something that I find useful or interesting.\n\n",
				"date_published": "2025-01-18T18:20:06-06:00",
				"url": "https://www.gettinggrey.com/2025/01/18/hello-world.html",
				"tags": ["meta"]
			}
	]
}
